app/controllers/books_controller.rb

INSERT INTO "books" ("title", "category", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "asdasda"], ["category", "asdasd"], ["body", "adasdasdasdasd"], ["created_at", "2021-04-08 12:27:06.803250"], ["updated_at", "2021-04-08 12:27:06.803250"]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    if @book.save
      redirect_to book_path(@book)
    else
      @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "aaaaaaaaaaaaaaaaaae"], ["updated_at", "2021-04-11 09:02:52.009549"], ["id", 19]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)
      redirect_to book_path(@book)
    else
      @books = Book.find(params[:id])